In [139]:
import pandas as pd
import numpy as np

In [140]:
#create messey sample empolyee data
data ={
    "EmpId": [101, 102, "103", 104, 105, 106, 107, 108, 109, 110],
    "fullname": [
        " Alice Johnson ", "MICHEAL smith", "sarah lee", "David-Kim", None, "john brown",
        "Emma Wilson", "Tom  davis", "Jane Miller", "Chris taylor"
    ],
     "Dept": ["IT", "hr", "Mktng", "IT", "Customer Care", "marketing", "Finance", None, "HR", "marketing"],
    "Age": [29, "thirty-five", 26, 31, 42, 27, 33, 30, None, 28],
    "Salary($)": ["$5000.50", "4800", "4200.75", "Nan", "6100", "4,300", "5800", "5000", "4700.0", "4400"],
    "JoinDate": [
        "2021/04/12", "2020/11/01", "2022/01/18", "2019/9/25", "2018/07/05",
        "2021/10/14", "2019/12/01", "2020/03/22", "2021/05/10", "2022/02/05"
    ],
    "Performance": [ 87, "73", 90, 65, 82, 75, 88, None, "79%", "91"],
    "Remote?": ["Yes", "No", "Y", "N", "yes", "no", "Y", "Yes", None, "True"]


}

In [141]:
#create a dataframe for the data
df = pd.DataFrame(data)

#convert dataframe in csv file
df.to_csv("data/employee_dataset.csv", index=False)

#load dataset
df = pd.read_csv("data/employee_dataset.csv")
df

,EmpId,fullname,Dept,Age,Salary($),JoinDate,Performance,Remote?
0,101,Alice Johnson,IT,29,$5000.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020/11/01,73,No
2,103,sarah lee,Mktng,26,4200.75,2022/01/18,90,Y
3,104,David-Kim,IT,31,Nan,2019/9/25,65,N
4,105,NaN,Customer Care,42,6100,2018/07/05,82,yes
5,106,john brown,marketing,27,"4,300",2021/10/14,75,no
6,107,Emma Wilson,Finance,33,5800,2019/12/01,88,Y
7,108,Tom davis,NaN,30,5000,2020/03/22,NaN,Yes
8,109,Jane Miller,HR,NaN,4700.0,2021/05/10,79%,NaN
9,110,Chris taylor,marketing,28,4400,2022/02/05,91,True

In [142]:
#get the shape for the dataset
df.shape

(10, 8)

In [143]:
#get the information about dataset
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmpId        10 non-null     int64
 1   fullname     9 non-null      str
 2   Dept         9 non-null      str
 3   Age          9 non-null      str
 4   Salary($)    10 non-null     str
 5   JoinDate     10 non-null     str
 6   Performance  9 non-null      str
 7   Remote?      9 non-null      str
dtypes: int64(1), str(7)
memory usage: 772.0 bytes

In [144]:
#get the first five rows
df.head()

,EmpId,fullname,Dept,Age,Salary($),JoinDate,Performance,Remote?
0,101,Alice Johnson,IT,29,$5000.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020/11/01,73,No
2,103,sarah lee,Mktng,26,4200.75,2022/01/18,90,Y
3,104,David-Kim,IT,31,Nan,2019/9/25,65,N
4,105,NaN,Customer Care,42,6100,2018/07/05,82,yes

In [145]:
#get the dataset columns
df.columns

Index(['EmpId', 'fullname', 'Dept', 'Age', 'Salary($)', 'JoinDate',
       'Performance', 'Remote?'],
      dtype='str')

In [146]:
#check for missing values
df.isnull().sum()

EmpId          0
fullname       1
Dept           1
Age            1
Salary($)      0
JoinDate       0
Performance    1
Remote?        1
dtype: int64

In [147]:
#inspect the unique values columns
print(df['Dept'].unique())
print(df['Age'].unique())
print(df['Remote?'].unique())

<StringArray>
['IT', 'hr', 'Mktng', 'Customer Care', 'marketing', 'Finance', nan, 'HR']
Length: 8, dtype: str
<StringArray>
['29', 'thirty-five', '26', '31', '42', '27', '33', '30', nan, '28']
Length: 10, dtype: str
<StringArray>
['Yes', 'No', 'Y', 'N', 'yes', 'no', nan, 'True']
Length: 8, dtype: str

In [148]:
#access series data
df['Salary($)'].tolist()

['$5000.50',
 '4800',
 '4200.75',
 'Nan',
 '6100',
 '4,300',
 '5800',
 '5000',
 '4700.0',
 '4400']

In [149]:
df['fullname'].tolist()

[' Alice Johnson ',
 'MICHEAL smith',
 'sarah lee',
 'David-Kim',
 nan,
 'john brown',
 'Emma Wilson',
 'Tom  davis',
 'Jane Miller',
 'Chris taylor']

In [150]:
df['Salary($)'].head()

0    $5000.50
1        4800
2     4200.75
3         Nan
4        6100
Name: Salary($), dtype: str

In [151]:
#start cleaning inconsistent values
# rename inconsistence columns
df.rename(columns={
    'EmpId': 'emp_id',
    'fullname': 'full_name',
    'Dept': 'department',
    'Age': 'age',
    'Salary($)': 'salary',
    'JoinDate': 'join_date',
    'Performance': 'performance',
    'Remote?': 'remote'
}, inplace=True)

df

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29,$5000.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020/11/01,73,No
2,103,sarah lee,Mktng,26,4200.75,2022/01/18,90,Y
3,104,David-Kim,IT,31,Nan,2019/9/25,65,N
4,105,NaN,Customer Care,42,6100,2018/07/05,82,yes
5,106,john brown,marketing,27,"4,300",2021/10/14,75,no
6,107,Emma Wilson,Finance,33,5800,2019/12/01,88,Y
7,108,Tom davis,NaN,30,5000,2020/03/22,NaN,Yes
8,109,Jane Miller,HR,NaN,4700.0,2021/05/10,79%,NaN
9,110,Chris taylor,marketing,28,4400,2022/02/05,91,True

In [152]:
#clean inconsistent values in full_name
df['full_name'] = df['full_name'].str.strip()
df['full_name'] = df['full_name'].str.title()
df['full_name'] = df['full_name'].str.replace(r'\s+', " ", regex=True)
df['full_name'] = df['full_name'].str.replace('-', " ")
df['full_name'].tolist()

['Alice Johnson',
 'Micheal Smith',
 'Sarah Lee',
 'David Kim',
 nan,
 'John Brown',
 'Emma Wilson',
 'Tom Davis',
 'Jane Miller',
 'Chris Taylor']

In [153]:
#clean inconsistent values in department
df['department'] = df['department'].replace({
    'hr': 'HR',
    'Mktng': 'Marketing',
    'marketing': 'Marketing',
    
})
df['department']

0               IT
1               HR
2        Marketing
3               IT
4    Customer Care
5        Marketing
6          Finance
7              NaN
8               HR
9        Marketing
Name: department, dtype: str

In [154]:
#clean inconsistent values in age
def clean_age(value):
    if value == 'thirty-five':
        return 35
    elif isinstance(value, (int, float)):
        return value
    elif isinstance(value, str) and value.isdigit():
        return int(value)
    else:
       return np.nan
df['age'] = df['age'].apply(clean_age)
df['age']

0    29.0
1    35.0
2    26.0
3    31.0
4    42.0
5    27.0
6    33.0
7    30.0
8     NaN
9    28.0
Name: age, dtype: float64

In [155]:
#clean inconsistent value in salary column
df['salary'] = (
    df['salary']
    .astype(str)
    .replace('[$,]', "", regex=True)
    .replace("Nan", np.nan)
    .astype(float)

)
df['salary']

0    5000.50
1    4800.00
2    4200.75
3        NaN
4    6100.00
5    4300.00
6    5800.00
7    5000.00
8    4700.00
9    4400.00
Name: salary, dtype: float64

In [156]:
#clean inconsistent value in join-date column
df['join_date'] = pd.to_datetime(df['join_date'], errors="coerce")
df['join_date']

0   2021-04-12
1   2020-11-01
2   2022-01-18
3   2019-09-25
4   2018-07-05
5   2021-10-14
6   2019-12-01
7   2020-03-22
8   2021-05-10
9   2022-02-05
Name: join_date, dtype: datetime64[us]

In [157]:
#clean inconsistent value in performance column
df['performance'] = (
    df['performance']
    .astype(str)
    .str.replace('%', "", regex=False)
    .replace("None", np.nan)
    .astype(float)

)
df['performance']

0    87.0
1    73.0
2    90.0
3    65.0
4    82.0
5    75.0
6    88.0
7     NaN
8    79.0
9    91.0
Name: performance, dtype: float64

In [158]:
#clean inconsistent value in remote column
df['remote'] = df['remote'].replace({
    'Y': 'Yes',
    'N': 'No',
    'yes': 'Yes',
    'no': 'No',
    "True": 'Yes',
    "None": np.nan
})
df['remote']

0    Yes
1     No
2    Yes
3     No
4    Yes
5     No
6    Yes
7    Yes
8    NaN
9    Yes
Name: remote, dtype: str

In [159]:
#clean inconsistent value in emp_id column
df['emp_id'] = pd.to_numeric(df['emp_id'], errors='coerce')
df['emp_id']

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: emp_id, dtype: int64

In [160]:
#check the data info
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   emp_id       10 non-null     int64
 1   full_name    9 non-null      str
 2   department   9 non-null      str
 3   age          9 non-null      float64
 4   salary       9 non-null      float64
 5   join_date    10 non-null     datetime64[us]
 6   performance  9 non-null      float64
 7   remote       9 non-null      str
dtypes: datetime64[us](1), float64(3), int64(1), str(3)
memory usage: 772.0 bytes

In [161]:
#hnadle missing value
df['full_name'] = df['full_name'].fillna('Unknown')
df['full_name']

0    Alice Johnson
1    Micheal Smith
2        Sarah Lee
3        David Kim
4          Unknown
5       John Brown
6      Emma Wilson
7        Tom Davis
8      Jane Miller
9     Chris Taylor
Name: full_name, dtype: str

In [162]:
df['department'] = df['department'].fillna(df['department'].mode()[0])
df['department']

0               IT
1               HR
2        Marketing
3               IT
4    Customer Care
5        Marketing
6          Finance
7        Marketing
8               HR
9        Marketing
Name: department, dtype: str

In [163]:
df['age'] = df['age'].fillna(df['age'].median())
df['age']

0    29.0
1    35.0
2    26.0
3    31.0
4    42.0
5    27.0
6    33.0
7    30.0
8    30.0
9    28.0
Name: age, dtype: float64

In [164]:
df['salary'] = df['salary'].fillna(df['salary'].median())
df['salary']

0    5000.50
1    4800.00
2    4200.75
3    4800.00
4    6100.00
5    4300.00
6    5800.00
7    5000.00
8    4700.00
9    4400.00
Name: salary, dtype: float64

In [165]:
df['performance'] = df['performance'].fillna(df['performance'].median())
df['performance']

0    87.0
1    73.0
2    90.0
3    65.0
4    82.0
5    75.0
6    88.0
7    82.0
8    79.0
9    91.0
Name: performance, dtype: float64

In [166]:
df['remote'] = df['remote'].fillna(df['remote'].mode()[0])
df['remote']

0    Yes
1     No
2    Yes
3     No
4    Yes
5     No
6    Yes
7    Yes
8    Yes
9    Yes
Name: remote, dtype: str

In [167]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   emp_id       10 non-null     int64
 1   full_name    10 non-null     str
 2   department   10 non-null     str
 3   age          10 non-null     float64
 4   salary       10 non-null     float64
 5   join_date    10 non-null     datetime64[us]
 6   performance  10 non-null     float64
 7   remote       10 non-null     str
dtypes: datetime64[us](1), float64(3), int64(1), str(3)
memory usage: 772.0 bytes

In [168]:
#working with filter data
df.head()

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.50,2021-04-12,87.0,Yes
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes

In [169]:
df['full_name']

0    Alice Johnson
1    Micheal Smith
2        Sarah Lee
3        David Kim
4          Unknown
5       John Brown
6      Emma Wilson
7        Tom Davis
8      Jane Miller
9     Chris Taylor
Name: full_name, dtype: str

In [170]:
df[['full_name', 'salary', 'performance']]

       full_name   salary  performance
0  Alice Johnson  5000.50         87.0
1  Micheal Smith  4800.00         73.0
2      Sarah Lee  4200.75         90.0
3      David Kim  4800.00         65.0
4        Unknown  6100.00         82.0
5     John Brown  4300.00         75.0
6    Emma Wilson  5800.00         88.0
7      Tom Davis  5000.00         82.0
8    Jane Miller  4700.00         79.0
9   Chris Taylor  4400.00         91.0

In [171]:
df.iloc[0:3, 0:3]

   emp_id      full_name department
0     101  Alice Johnson         IT
1     102  Micheal Smith         HR
2     103      Sarah Lee  Marketing

In [172]:
df.iloc[0:3]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.50,2021-04-12,87.0,Yes
1,102,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes

In [173]:
df.loc[df['salary'] >= 5000]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.5,2021-04-12,87.0,Yes
4,105,Unknown,Customer Care,42.0,6100.0,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.0,2020-03-22,82.0,Yes

In [174]:
df.loc[df['salary'] >= 5000]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.5,2021-04-12,87.0,Yes
4,105,Unknown,Customer Care,42.0,6100.0,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.0,2020-03-22,82.0,Yes

In [175]:
df.loc[df['salary'] >= 5000, ['full_name', 'department']]

       full_name     department
0  Alice Johnson             IT
4        Unknown  Customer Care
6    Emma Wilson        Finance
7      Tom Davis      Marketing

In [176]:
df[df['department'] == 'IT']

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.5,2021-04-12,87.0,Yes
3,104,David Kim,IT,31.0,4800.0,2019-09-25,65.0,No

In [177]:
df[df['age'] > 30]

,emp_id,full_name,department,age,salary,join_date,performance,remote
1,102,Micheal Smith,HR,35.0,4800.0,2020-11-01,73.0,No
3,104,David Kim,IT,31.0,4800.0,2019-09-25,65.0,No
4,105,Unknown,Customer Care,42.0,6100.0,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes

In [178]:
df[df['department'] != 'HR']

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.50,2021-04-12,87.0,Yes
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
3,104,David Kim,IT,31.0,4800.00,2019-09-25,65.0,No
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes
5,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No
6,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes

In [179]:
df[
    (df['salary'] > 4000) & (df['remote'] == 'Yes')
    ]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.50,2021-04-12,87.0,Yes
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
4,105,Unknown,Customer Care,42.0,6100.00,2018-07-05,82.0,Yes
6,107,Emma Wilson,Finance,33.0,5800.00,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes
8,109,Jane Miller,HR,30.0,4700.00,2021-05-10,79.0,Yes
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes

In [180]:
df[df['department'].isin(['IT', 'Finance'])]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.5,2021-04-12,87.0,Yes
3,104,David Kim,IT,31.0,4800.0,2019-09-25,65.0,No
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes

In [181]:
df[df['full_name'].str.contains('john', case=False)]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.5,2021-04-12,87.0,Yes
5,106,John Brown,Marketing,27.0,4300.0,2021-10-14,75.0,No

In [182]:
df[df['department'].str.startswith('M')]

,emp_id,full_name,department,age,salary,join_date,performance,remote
2,103,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
5,106,John Brown,Marketing,27.0,4300.00,2021-10-14,75.0,No
7,108,Tom Davis,Marketing,30.0,5000.00,2020-03-22,82.0,Yes
9,110,Chris Taylor,Marketing,28.0,4400.00,2022-02-05,91.0,Yes

In [186]:
df[
    (df['join_date'] > "2019-01-01") & (df['join_date'] < "2021-12-13")
    ]

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29.0,5000.5,2021-04-12,87.0,Yes
1,102,Micheal Smith,HR,35.0,4800.0,2020-11-01,73.0,No
3,104,David Kim,IT,31.0,4800.0,2019-09-25,65.0,No
5,106,John Brown,Marketing,27.0,4300.0,2021-10-14,75.0,No
6,107,Emma Wilson,Finance,33.0,5800.0,2019-12-01,88.0,Yes
7,108,Tom Davis,Marketing,30.0,5000.0,2020-03-22,82.0,Yes
8,109,Jane Miller,HR,30.0,4700.0,2021-05-10,79.0,Yes